#include <iostream>
#include <vector>
#include <string>
#include <algorithm>
#include <random>
//====================================================================================================================
enum class state_player
{
	ALIVE, DEATH, FELL, BAT, KILL_TO_VAMPUS
};
//====================================================================================================================
// CAVE_LIST
//====================================================================================================================
struct Cave_List
{
	std::vector<std::vector<int>> generate_rooms();	// Генерация комнат
	Cave_List *game(std::vector<std::vector<int>> cave_array);
	std::vector<std::vector<int>> cave;


	std::vector<int> bat = { 2, 5, 8, 13, 16, 19 };
	std::vector<int> fel = { 1, 6, 9, 12, 15, 18 };
	int wampus = 17;
};
//====================================================================================================================
std::vector<std::vector<int>> Cave_List::generate_rooms() {
//	std::mt19937 gen(time(nullptr));
	std::vector<std::vector<int>> result;

	//	Жёсткая генерация пещеры
	result[0] =  {  7,  5, 2  };
	result[1] =  {  5, 14, 8  };
	result[2] =  {  3,  0, 4  };
	result[3] =  { 10,  9, 2  };
	result[4] =  {  2,  6, 11 };
	result[5] =  {  7,  0, 1  };
	result[6] =  {  4, 11, 14 };
	result[7] =  {  9,  0, 5  };
	result[8] =  { 14,  1, 11 };
	result[9] =  { 12,  7, 3  };
	result[10] = {  3, 13, 16 };
	result[11] = {  8,  6, 4  };
	result[12] = {  9, 13, 15 };
	result[13] = { 15, 12, 10 };
	result[14] = {  1,  8, 6  };
	result[15] = { 18, 13, 12 };
	result[16] = { 19, 17, 10 };
	result[17] = { 16, 19, 18 };
	result[18] = { 17, 19, 15 };
	result[19] = { 16, 17, 18 };
	return result; }
//====================================================================================================================
Cave_List *Cave_List::game(std::vector<std::vector<int>> cave_array) {
	state_player current_state;
	current_state = state_player::ALIVE;
	int move = 0;
	int player = 7;
	std::vector<int> current = {};
	std::string stroke = {};

	while (current_state == state_player::ALIVE) {

		current = cave_array[player];

		std::cout << "You are in the room: " << player << '\n';		// Где игрок сейчас

		std::cout << "You are movine to rooms: ";

		for (int a : current)
			std::cout << a << '   ';
			
		std::cout << '\n';

		for (int a : current)										// Проверяем примыкающие комнаты с игроком на предмет опасности
		{
			for (int b : bat)
				if (a == b) std::cout << "I hear a bat\n";

			for (int c : fel)
				if (a == c) std::cout << "I feel the breeze\n";

			if (a == wampus) std::cout << "I smell Wampus\n";
		}

		std::cout << "What are you going to do?\n";
		std::cin >> stroke;											// Ввод m* or s*
	
		std::string res = {};
		char s = stroke[0];

		for (char m : stroke) {
			if (std::isdigit(m))
				res += m;
		}

		if (s == 's')
		{
			// Логика стрельбы
		}

		if (s == 'm') {
			int m = std::stoi(stroke);
			player = m;
		}

		for (int ba : bat)
			if (player == ba) player = rand() % 20;
		for (int fe : fel)
			if (player == fe) current_state = state_player::FELL;
		if (player == wampus) current_state = state_player::DEATH;

		if (current_state == state_player::FELL)
			std::cout << "You fell into a hole!\n";

		if (current_state == state_player::DEATH)
			std::cout << "You were killed by Wampus\n";
	}
}
//====================================================================================================================
int main()
{
	std::cout << "Welcome to the GAME 'HUNT TO VAMPUS'" << '\n';

	Cave_List cave;

	while (true) {
		std::vector<std::vector<int>> start_rooms = cave.generate_rooms();	// Определили вектор с псевдослучайными числами(наши комнаты)

		cave.game(start_rooms);

	} 

	return 0;
}
//====================================================================================================================
/*
	12. Реализуйте версию игры “Охота на Вампуса”(или просто “Вамп”).
Это простая компьютерная(не графическая) игра, изобретенная Грегори Йобом(Gregory Yob).

- Цель этой игры — найти довольно смышленого монстра, прячущегося в темном пещерном лабиринте.

- Ваша задача — убить вампуса с помощью лука и стрел.Кроме вампуса, пещера таит еще две опасности : бездонные ямы и гигантские
летучие мыши.

- Если вы входите в комнату с бездонной ямой, то игра для вас закончена.

- Если вы входите в комнату с летучей мышью, то она вас хватает и перебрасывает в другую комнату.

- Если же вы входите в комнату с вампусом или он входит в комнату, где находитесь вы, он вас съедает.

- Входя в комнату, вы должны получить предупреждение о грозящей опасности.

** “Я чувствую запах вампуса” — значит, он в соседней комнате.
** “Я чувствую ветерок” — значит, в соседней комнате яма.
** “Я слышу летучую мышь” — значит, в соседней комнате живет летучая мышь.

- Для вашего удобства комнаты пронумерованы.Каждая комната соединена туннелями с тремя другими.

- Когда вы входите в комнату, то получаете сообщение, например : “Вы в комнате номер 12; отсюда
идут туннели в комнаты 1, 13 и 4; идти или стрелять ? ” Возможные ответы : m13(“Переход в комнату
номер 13”) и s13–4–3(“Стрелять через комнаты с номерами 13, 4 и 3”).
- Стрела может пролететь через три комнаты.В начале игры у вас есть пять стрел.
Загвоздка со стрельбой заключается в том, что вы можете разбудить вампуса и он войдет в комнату,
соседнюю с той, где он спал, — она может оказаться вашей комнатой.

- Вероятно, самой сложной частью этого упражнения является программирование пещеры и выбор комнат,
связанных с другими комнатами.Возможно, вы захотите использовать датчик случайных чисел, чтобы при разных запусках программы
использовались разные пещеры и разное расположение летучих мышей и вампуса.Подсказка : используйте режим
отладки для проверки состояния лабиринта.
*/
//====================================================================================================================